from random import choice
key = {'а': [46, 42], 'б': [19, 72], 'в': [85, 77], 'г': [28, 90], 'д': [89, 57],
       'е': [56, 52], 'ё': [74, 22], 'ж': [13, 62], 'з': [23, 75], 'и': [83, 16],
       'й': [24, 66], 'к': [18, 29], 'л': [48, 67], 'м': [98, 80], 'н': [15, 34],
       'о': [45, 59], 'п': [20, 79], 'р': [17, 36], 'с': [70, 73], 'т': [31, 21],
       'у': [88, 10], 'ф': [78, 95], 'х': [86, 12], 'ц': [99, 33], 'ч': [53, 63],
       'ш': [11, 96], 'щ': [43, 87], 'ъ': [32, 41], 'ы': [64, 81], 'ь': [60, 54],
       'э': [44, 92], 'ю': [61, 25], 'я': [40, 84]}
def code(m):
    answer = ""
    for i in m:
        answer += str(choice(key[i]))
    return answer
def decode(c):
    answer = ""
    for i in range(len(c) // 2):
        n = int(c[2*i]+c[2*i+1])
        for j in key:
            if key[j][0] == n or key[j][1] == n:
                answer += j
                break
    return answer
m = input()
c = code(m)
print(c)
print(decode(c))
