#функция преобразования сторки в битовую строку
def v_biti(s):
    b = ""
    for i in s:
        b += bin(ord(i) - ord("А") + 192)[2:]
    return b

#функция нахождения ключа из фамилии
def klyuch(s):
    k = ""
    for i in range(len(s)):
        if (i + 1) % 8 != 0:
            k += s[i]
    return k

#функция xorа двух строк
def xor(a, b):
    c = ""
    for i in range(len(a)):
        c += str((int(a[i]) + int(b[i])) % 2)
    return c

#функция печати битовой строки в блоки по 4 бита
def pechat(s, stroka, rasmer = 4):
    print(stroka, end = "")
    for i in range(len(s)):
        print(s[i], end = "")
        if (i + 1) % rasmer == 0:
            print(" ", end = "")
    print()
    
#функция нахождения начальной перестановки
def nach_perestanovka(s):
    s1 = ""
    for i in range(58, 66, 2):
        for j in range(i, 1, -8):
            s1 += s[j - 1]
    for i in range(57, 65, 2):
        for j in range(i, 0, -8):
            s1 += s[j - 1]
    return s1

#функция расширения
def rasshiranie(r):
    r1 = ""
    a = 32
    b = 5
    for i in range(8):
        r1 += r[a-1] + r[4*i] + r[4*i + 1] + r[4*i + 2] + r[4*i + 3] + r[b-1]
        a = (a + 4) % 32
        b = (b + 4) % 32
    return r1

#функция поиска ключа раунда
def klyuch_rounda(key):
    k = ""
    for i in range(len(key)):
        if (i + 1) % 8 != 0 and i != len(key) - 2 :
            k += key[i]
    return k

#функция s-блоков
def s_blocki(r):
    s1 = [[14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7], [0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8], [4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0], [15, 12, 8, 2, 4, 9, 2, 7, 5, 11, 3, 14, 10, 0, 6, 13]]
    s2 = [[15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10], [3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5], [0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15], [13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9]]
    s3 = [[10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8], [13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1], [13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7], [1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12]]
    s4 = [[7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15], [13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9], [10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4], [3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14]]
    s5 = [[2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9], [14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6], [4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14], [11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 3, 5, 3]]
    s6 = [[12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11], [10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8], [9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6], [4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13]]
    s7 = [[4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1], [13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6], [1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2], [6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12]]
    s8 = [[13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7], [1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2], [7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8], [2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11]]
    b = [s1, s2, s3, s4, s5, s6, s7, s8]
    otvet = ""
    for i in range(8):
        s = b[i]
        stroka = int(r[6*i])*2 + int(r[6*i+5])
        stolbik = int(r[6*i+1])*8 + int(r[6*i+2])*4 + int(r[6*i+3])*2 + int(r[6*i+4])
        x = bin(s[stroka][stolbik])[2:]
        otvet += "0"*(4 - len(x)) + x
    return otvet

#функция p-перестановки
def p_perestanovka(r):
    p = [16, 7, 20, 21, 29, 12, 28, 17, 1, 15, 23, 26, 5, 18, 31, 10, 2, 8, 24, 14, 32, 27, 3, 9, 19, 13, 30, 6, 22, 11, 4, 25]
    r1 = ""
    for i in p:
        r1 += r[i - 1]
    return r1

#финальная перестановка
def final_perestanovka(s):
    spisok = [40, 8, 48, 16, 56, 24, 64, 32]
    s1 = ""
    for i in range(8):
        for j in spisok:
            s1 += s[j - i - 1]
    return s1

def DES(b, key):
    #начальная перестановка
    b = nach_perestanovka(b)
    
    l = b[:32]
    r = b[32:]
    #расширение
    r1 = rasshiranie(r)
    
    #функция нахождения ключа раунда
    key = klyuch_rounda(key)
    
    #отбеливание
    r1 = xor(r1, key)
    
    #S-блоки
    r1 = s_blocki(r1)

    #p-перестановка
    r1 = p_perestanovka(r1)

    #нахождение финального r1
    r1 = xor(r1, l)
    l1 = r
    #финальная перестановка
    return final_perestanovka(l1+r1)

b = v_biti("ИвановИ")
key = klyuch(v_biti("Иванович"))
otvet = DES(b, key)
pechat(otvet, "DES1 = ", 8)
